Revit 2027 API
Pipe.IsPipingConnector Method
 Checks if the given connector is a valid piping connector.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsPipingConnector(
	Connector connector
)
Public Shared Function IsPipingConnector (
	connector As Connector
) As Boolean
public:
static bool IsPipingConnector(
	Connector^ connector
)
static member IsPipingConnector :
        connector : Connector -> bool
Parameters
connector Connector
 Connector to check
Return Value
Boolean
 True if the connector has the Piping domain type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A connector must be Piping domain type to be connected with other pipes.
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace